/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   terminos_type.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: selly <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/05/29 11:57:43 by selly             #+#    #+#             */
/*   Updated: 2019/05/29 15:51:52 by selly            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "tetriminos.h"

int		type_F(char *str) /*здесь будет проверка на 6 фигуру*/
{
	return (0);
}

int		type_D(char *str) /*здесь будет проверка на 4 фигуру*/
{
	return (0);
}

int		type_C(char *str) /*здесь будет проверка на 3 фигуру*/ 
{
	return (0);
}
int		type_B(char *str) /*здесь будет проверка на 2 фигуру*/
{
	int		i;
	int		line;

	line = 4;
	i = touch(str);
	return (-1);
}
