/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   tetr_parser.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dmorrige <dmorrige@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/05/29 10:57:16 by dmorrige          #+#    #+#             */
/*   Updated: 2019/05/29 12:02:57 by dmorrige         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "tetriminos.h"

unsigned int	tetr_parser(char *a)
{
	if (!a || !(*a))
		ft_invalid_tetr();
	if (a[4] != '\n' || a[9] != '\n' || a[14] != '\n' || a[19] != '\n')
		ft_invalid_tetr();
	// тут проверка на . и #
}
